{
  "backend/main.mo": "Main canister actor managing user profiles, test attempts, course progress, news caching, and authorization with logic for Day 1 test scoring and unlocking Day 2.",
  "backend/migration.mo": "Defines old/new state structures and a simple migration that renames boolMap to progressFlags.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file listing short summaries of various frontend source files.",
  "frontend/index.css": "Global Tailwind-based style definitions with OKLCH variables, theming, and dark mode overrides.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Main React router setup defining all routes including Day 1 pages, news, chat, and Pro AI Interviewer.",
  "frontend/src/components/course/StoryModeTopicCard.tsx": "Topic card component displaying a story-mode lesson with short story, example, and usage guidance.",
  "frontend/src/components/friendChat/ChatGPTUnavailableNotice.tsx": "Alert component explaining built‑in chat assistant behavior and Power Mode enhancements.",
  "frontend/src/components/news/NewsFallbackInAppBrowser.tsx": "Allows users to input and persist a fallback news URL and view it in an iframe when official news is unavailable.",
  "frontend/src/components/news/NewsItemRow.tsx": "Displays a news item with TTS controls for reading headlines and previews aloud.",
  "frontend/src/components/news/NewsSection.tsx": "Shows region-specific news with loading, error, empty states, and fallback browser support.",
  "frontend/src/components/news/TopUSHeadlinesSection.tsx": "Fetches and displays top US headlines with loading, error, empty, and success states.",
  "frontend/src/components/progress/MistakeTracker.tsx": "Displays learned items and improvement areas based on user progress, with loading handling.",
  "frontend/src/components/proInterviewer/BottomMicControl.tsx": "Renders a floating microphone button that toggles recording mode with animated UI feedback.",
  "frontend/src/components/test/ResultEffects.tsx": "Renders animated confetti on a canvas when enabled.",
  "frontend/src/config/newsDataSource.ts": "Defines and toggles between demo and backend news data sources.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refetching dependent queries on change.",
  "frontend/src/hooks/useAiMode.ts": "Determines whether AI mode is enabled based on provider status and handles connection errors.",
  "frontend/src/hooks/useCourseProgress.ts": "Hooks for querying and mutating user profile, course progress, day lock status, and test scores via the backend actor using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity persistence using AuthClient.",
  "frontend/src/hooks/useInterviewReports.ts": "Hooks to fetch interview analysis reports and add new analysis entries, with query invalidation on updates.",
  "frontend/src/hooks/useLocalSettings.ts": "Manages browser‑local user settings such as API keys, provider enable flags, and computes provider status.",
  "frontend/src/hooks/useMistakeTracker.ts": "Loads, stores, and updates mistake‑tracking data from local storage.",
  "frontend/src/hooks/usePowerMode.ts": "Manages a locally stored OpenAI key, validates it, and exposes Power Mode activation state.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for fetching and refreshing region‑specific news from the backend, with demo‑mode handling.",
  "frontend/src/hooks/useRegionNews.ts": "Fetches, parses, and caches region news with demo‑mode overrides and provides full refresh support.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements browser‑only speech‑to‑text using the Web Speech API with local transcript handling and error reporting.",
  "frontend/src/hooks/useUSNews.ts": "Provides React Query hooks to fetch and refresh US news via an actor instance.",
  "frontend/src/index.css": "Defines Tailwind styles, theme variables, and custom glass and neon utility classes.",
  "frontend/src/lib/course/day1LessonContent.ts": "Contains structured Day 1 lesson data including grammar topics and vocabulary words with story-mode examples.",
  "frontend/src/lib/course/day1TestQuestions.ts": "Exports a list of multiple‑choice Day 1 test questions focused on Is/Am/Are usage.",
  "frontend/src/lib/course/dayWiseTestGenerator.ts": "Generates Day 1 test questions with topic metadata based on lesson content.",
  "frontend/src/lib/course/essayGrammarCheck.ts": "Checks essay lines for grammar issues using detectAndCorrect and returns corrections.",
  "frontend/src/lib/course/essayPowerModeFeedback.ts": "Provides enhanced essay grammar corrections, suggestions, and a score using detectAndCorrect.",
  "frontend/src/lib/course/essayScoring.ts": "Scores an essay from 0–20 using heuristics on length, sentences, punctuation, and vocabulary.",
  "frontend/src/lib/course/types.ts": "Defines shared types for lesson topics, story‑mode sections, and vocabulary words.",
  "frontend/src/lib/friendChat/types.ts": "Defines the ChatMessage type used for user and tutor chat entries.",
  "frontend/src/lib/friendTutor/analyzeUserMessage.ts": "Analyzes user text for grammar issues, tone, vocabulary level, and power‑answer patterns, returning a structured analysis object.",
  "frontend/src/lib/friendTutor/detectAndCorrect.ts": "Applies regex-based grammar rules to detect and auto-correct common English mistakes, returning corrected text or null.",
  "frontend/src/lib/friendTutor/generatePowerTutorReply.ts": "Generates detailed Power Mode tutor replies with safety checks, handling greetings, questions, short messages, and long messages.",
  "frontend/src/lib/friendTutor/generateTutorReply.ts": "Produces normal tutor replies based on personality mode with basic safety checks and common conversational patterns.",
  "frontend/src/lib/friendTutor/powerAnswers.ts": "Detects simple phrases matching power‑answer rules and suggests stronger vocabulary alternatives.",
  "frontend/src/lib/friendTutor/progressReport.ts": "Tracks session statistics and generates a progress report summarizing grammar fixes, tone, vocabulary tips, and power‑ups.",
  "frontend/src/lib/news/demoNewsData.ts": "Provides static demo news items for several regions with headlines and previews for development and testing.",
  "frontend/src/lib/news/fallbackNewsUrlStorage.ts": "Provides get, set, and clear helpers for region‑specific fallback news URLs using localStorage with error handling.",
  "frontend/src/lib/news/parseNews.ts": "Parses GNews API JSON, extracts up to 10 cleaned news items, and returns errors or empty results safely.",
  "frontend/src/lib/news/regionConfig.ts": "Defines Region type and a list of supported regions with IDs, names, and flags.",
  "frontend/src/lib/news/validateHttpUrl.ts": "Validates and normalizes HTTP/HTTPS URLs, returning errors for invalid or unsupported formats.",
  "frontend/src/lib/powerMode/powerModeStorage.ts": "Handles storing, retrieving, and clearing the local-only OpenAI API key from localStorage.",
  "frontend/src/lib/powerMode/validateOpenAIKey.ts": "Validates OpenAI API key format, allowing empty keys and requiring non-empty keys to start with 'sk-'.",
  "frontend/src/lib/progress/mistakeTrackerStorage.ts": "Provides localStorage read/write helpers for saving and loading mistake tracker lists.",
  "frontend/src/lib/proInterviewer/coachAnswer.ts": "Generates coaching feedback from a transcript including grammar correction, pronunciation hints, and category-based pro tips.",
  "frontend/src/lib/proInterviewer/documentTypes.ts": "Defines interfaces for uploaded documents, extraction outputs, interview questions, feedback, metrics, and formatting helpers.",
  "frontend/src/lib/proInterviewer/extractTextFromImage.ts": "Returns a failure response for image OCR, indicating manual text entry is required.",
  "frontend/src/lib/proInterviewer/extractTextFromPdf.ts": "Performs basic PDF text extraction using FileReader and returns readable text or fallback messages.",
  "frontend/src/lib/proInterviewer/metrics.ts": "Computes metrics like logic, clarity, filler count, and aggregates them across answers.",
  "frontend/src/lib/proInterviewer/questionGenerator.ts": "Generates interview questions from extracted document data, manual notes, and optional DAF mode.",
  "frontend/src/lib/proInterviewer/sessionReport.ts": "Builds a session report with scoring, body‑language proxy notes, logical assessment, and improvement areas.",
  "frontend/src/lib/proInterviewer/summarizeExtraction.ts": "Parses text to extract keywords, skills, education terms, roles, and achievement indicators with simple pattern matching.",
  "frontend/src/lib/security/blockOpenAIRequests.ts": "Implements runtime guards that intercept fetch and XHR to block requests to OpenAI/ChatGPT domains.",
  "frontend/src/lib/security/noOpenAIPolicy.ts": "Defines a policy object explaining that OpenAI/ChatGPT integrations are disallowed and lists alternative approaches.",
  "frontend/src/lib/settings/localSettingsStorage.ts": "Manages local-only storage of user settings such as API keys, external links, and provider enable states.",
  "frontend/src/lib/settings/providerStatus.ts": "Determines provider connection status based on enable flags and API key validity.",
  "frontend/src/lib/settings/validateKeys.ts": "Performs lightweight format validation for OpenAI and Gemini API keys without network calls.",
  "frontend/src/lib/tts/speakText.ts": "Controls browser text-to-speech playback, handling voice selection, cancellation, and error events.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/ComingSoonPage.tsx": "Displays a generic Coming Soon page using a feature param and a return-to-home button.",
  "frontend/src/pages/Day1LearningHubPage.tsx": "Renders Day 1 course content including grammar, vocabulary, essay guidance, and navigation to the test.",
  "frontend/src/pages/Day1TestPage.tsx": "Implements the Day 1 test flow with multiple‑choice and essay scoring, result animations, and score submission.",
  "frontend/src/pages/FriendChatPage.tsx": "Provides a chat interface with an AI friend, handling text/voice input, grammar correction, and generated tutor replies.",
  "frontend/src/pages/HomePage.tsx": "Renders the main navigation hub linking to news, chat, course, tests, progress, and interview features.",
  "frontend/src/pages/MyProgressPage.tsx": "Displays completed and unlocked course days, overall progress, and interview report data.",
  "frontend/src/pages/NewsPage.tsx": "Shows region‑based news sections with optional refresh and demo‑mode placeholder handling.",
  "frontend/src/pages/ProAIInterviewerPage.tsx": "Runs the multi‑step AI interview simulator including file upload, info extraction, question generation, answer recording, and session reporting.",
  "frontend/src/pages/SettingsPage.tsx": "React settings page allowing users to configure API keys, toggles, and local browser‑stored preferences with visual status indicators.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning URL hash values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, shadows, fonts, and container settings for the frontend.",
  "project_state.json": "Project state file describing feature requirements, versions, and configuration for a day‑wise testing system."
}