{
  "backend/main.mo": "Motoko canister managing user profiles, test attempts, course progress, streaks, badges, news caching, and authorization-protected actions.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend files across the app.",
  "frontend/index.css": "Global Tailwind base styles defining light/dark theme tokens and applying background/foreground variables.",
  "frontend/index.html": "HTML entry point loading fonts, mounting the React app, and bootstrapping main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring router, query client, daily reminder banner, and all route definitions.",
  "frontend/src/components/course/ClickableLessonText.tsx": "Component showing lesson text that lets users select text to save words or request sentence explanations.",
  "frontend/src/components/course/MyDictionarySection.tsx": "Displays the user's word bank with loading, error, empty, and authenticated states, and allows removing saved words.",
  "frontend/src/components/course/StoryModeTopicCard.tsx": "Renders a card showing a topic's story-mode content including a short story, real-life example, and usage guidance.",
  "frontend/src/components/course/TeacherAIPanel.tsx": "Provides a floating AI teacher chat panel where users submit sentences and receive local explanations.",
  "frontend/src/components/course/WordSaveDialog.tsx": "Modal dialog for saving a word and its meaning to the user's word bank with validation and mutation handling.",
  "frontend/src/components/friendChat/ChatGPTUnavailableNotice.tsx": "Shows an alert about the built‑in on-device chat assistant, with enhanced messaging when Power Mode is active.",
  "frontend/src/components/news/NewsFallbackInAppBrowser.tsx": "Lets users enter, store, validate, and open a fallback news URL inside an in-app iframe when regional news is unavailable.",
  "frontend/src/components/news/NewsItemRow.tsx": "Displays a news item with TTS playback controls for reading the headline and preview aloud.",
  "frontend/src/components/news/NewsPasteLinkInAppBrowser.tsx": "Allows users to paste, validate, store, and open a news URL in an in-app browser with error handling and clearing options.",
  "frontend/src/components/news/NewsSection.tsx": "Displays region-specific news with loading, error, empty, and list states.",
  "frontend/src/components/news/TopUSHeadlinesSection.tsx": "Fetches and displays top US headlines with parsing, error handling, and loading UI.",
  "frontend/src/components/progress/BadgeGallery.tsx": "Shows user badge milestones with login, loading, error, and earned badge states.",
  "frontend/src/components/progress/DailyStreakCard.tsx": "Displays the user's daily streak with login, loading, error, and success states.",
  "frontend/src/components/progress/MistakeTracker.tsx": "Shows learned items and areas to improve, with loading and empty states handled.",
  "frontend/src/components/proInterviewer/BottomMicControl.tsx": "Renders a floating microphone toggle button with active and inactive visual states.",
  "frontend/src/components/test/ResultEffects.tsx": "Renders animated confetti on a fullscreen canvas when enabled.",
  "frontend/src/config/newsDataSource.ts": "Configures whether news uses demo data or backend sources.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries.",
  "frontend/src/hooks/useAiMode.ts": "Handles whether AI mode should be used based on local settings and provider connection status, tracking errors and attempt state.",
  "frontend/src/hooks/useCourseProgress.ts": "Provides React Query hooks for fetching and updating user profile, course progress, day counts, and test scores through the backend actor.",
  "frontend/src/hooks/useDailyReminder.ts": "Manages daily reminder settings, notification permissions, scheduling, and in-app fallback reminders using local settings and progress data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context for authentication, loading stored identities, handling login and logout, and exposing related state.",
  "frontend/src/hooks/useInterviewReports.ts": "Fetches and mutates interview analysis reports via backend actor and invalidates queries on updates.",
  "frontend/src/hooks/useLocalSettings.ts": "Loads, updates, and stores local app settings such as API keys, provider enable flags, and reminder preferences, also computing provider status.",
  "frontend/src/hooks/useMistakeTracker.ts": "Loads and saves local mistake-tracking data, exposing learned and to-improve lists with update ability.",
  "frontend/src/hooks/usePowerMode.ts": "Manages a locally stored OpenAI API key for Power Mode, validating key format and determining mode activation.",
  "frontend/src/hooks/useQueries.ts": "Provides region news queries and refresh mutations, supporting demo mode and interacting with backend news methods.",
  "frontend/src/hooks/useRegionNews.ts": "Fetches and parses region news with demo mode support, tracks last updated timestamps, and provides a refetch-all mechanism.",
  "frontend/src/hooks/useSpeechToText.ts": "Provides a local Web Speech API hook for starting, stopping, and handling speech recognition events with transcript and error callbacks.",
  "frontend/src/hooks/useStreakBadges.ts": "React Query hooks for fetching and updating user streaks and badges through the backend actor.",
  "frontend/src/hooks/useUSNews.ts": "Hooks to fetch and refresh US news content from the backend using React Query.",
  "frontend/src/hooks/useWordBank.ts": "React Query hooks for retrieving, saving, and removing user word bank entries via the backend actor.",
  "frontend/src/index.css": "Global Tailwind-based styles defining theme variables, typography, glassmorphism, neon effects, and badge gradients.",
  "frontend/src/lib/course/day1LessonContent.ts": "Exports structured day 1 lesson content including grammar explanations and vocabulary words with story-based examples.",
  "frontend/src/lib/course/day1TestQuestions.ts": "Defines multiple-choice test questions for day 1 focused on correct use of is/am/are.",
  "frontend/src/lib/course/dayWiseTestGenerator.ts": "Generates Day 1 grammar and vocabulary multiple‑choice test questions based on lesson content. Defines the TestQuestion type and outputs an array of structured questions.",
  "frontend/src/lib/course/essayGrammarCheck.ts": "Checks each essay line using detectAndCorrect and returns counts and formatted corrections. Skips empty lines and summarizes whether errors exist.",
  "frontend/src/lib/course/essayPowerModeFeedback.ts": "Produces enhanced grammar corrections and writing suggestions for essays, including structure hints and a 10‑point score. Uses detectAndCorrect and additional heuristics.",
  "frontend/src/lib/course/essayScoring.ts": "Scores an essay from 0–20 using heuristics for length, sentences, capitalization, punctuation, and vocabulary. Returns score plus brief feedback summary.",
  "frontend/src/lib/course/types.ts": "Defines shared types for lessons, story mode subsections, topics, and vocabulary words. Provides reusable interfaces across course modules.",
  "frontend/src/lib/friendChat/types.ts": "Defines the ChatMessage structure with id, role, text, timestamps, and optional metadata. Supports tutor/user chat messages with optional corrections.",
  "frontend/src/lib/friendTutor/analyzeUserMessage.ts": "Analyzes user text for grammar, tone, vocabulary, keywords, and power‑answer suggestions. Combines detectAndCorrect with custom tone and vocabulary heuristics.",
  "frontend/src/lib/friendTutor/detectAndCorrect.ts": "Applies a set of regex‑based grammar rules to detect and auto‑correct common mistakes. Returns corrected text or null if no errors found.",
  "frontend/src/lib/friendTutor/generatePowerTutorReply.ts": "Generates detailed Power Mode tutor replies with safety checks, language detection, greetings, and context‑aware responses. Enhances replies with optional analysis and persona logic.",
  "frontend/src/lib/friendTutor/generateTutorReply.ts": "Generates AI tutor replies based on safety checks, language detection, personas, greetings, and context-aware strategies.",
  "frontend/src/lib/friendTutor/languageDetection.ts": "Detects Hindi/Hinglish via script and pattern checks and returns predefined mixed-language responses.",
  "frontend/src/lib/friendTutor/persona.ts": "Defines core identity and tone/style settings for friend, teacher, and AI personas and returns persona-specific descriptions.",
  "frontend/src/lib/friendTutor/powerAnswers.ts": "Detects simple phrases in user text and suggests stronger vocabulary alternatives.",
  "frontend/src/lib/friendTutor/progressReport.ts": "Accumulates session facts like grammar fixes and vocabulary tips and generates a formatted progress report.",
  "frontend/src/lib/friendTutor/replyStrategy.ts": "Analyzes message context (questions, length, topic) and generates mode-specific prompts or follow‑ups.",
  "frontend/src/lib/news/demoNewsData.ts": "Provides static demo news items for multiple regions for testing and development.",
  "frontend/src/lib/news/fallbackNewsUrlStorage.ts": "Stores, retrieves, and clears fallback news URLs in localStorage with prefixed keys.",
  "frontend/src/lib/news/parseNews.ts": "Parses GNews API JSON, handling errors and extracting up to 10 cleaned news items with headlines and previews.",
  "frontend/src/lib/news/pasteLinkStorage.ts": "Stores, retrieves, and clears a pasted news URL in localStorage with safe fallbacks.",
  "frontend/src/lib/news/regionConfig.ts": "Defines region metadata including IDs, names, and flag emojis.",
  "frontend/src/lib/news/validateHttpUrl.ts": "Validates and normalizes HTTP/HTTPS URLs, returning errors for invalid formats.",
  "frontend/src/lib/powerMode/powerModeStorage.ts": "Manages storing, retrieving, and clearing a local-only OpenAI API key in localStorage.",
  "frontend/src/lib/powerMode/validateOpenAIKey.ts": "Validates that non-empty OpenAI API keys start with 'sk-'.",
  "frontend/src/lib/progress/mistakeTrackerStorage.ts": "Provides localStorage read/write helpers for storing and retrieving mistake tracker lists.",
  "frontend/src/lib/proInterviewer/coachAnswer.ts": "Generates coaching feedback including grammar correction, pronunciation analysis, and tailored pro tips based on question category.",
  "frontend/src/lib/proInterviewer/documentTypes.ts": "Defines interfaces for uploaded documents, extraction results, interview questions, feedback, metrics, and utilities like file size formatting.",
  "frontend/src/lib/proInterviewer/extractTextFromImage.ts": "Returns a failure message for image OCR since no OCR library is available.",
  "frontend/src/lib/proInterviewer/extractTextFromPdf.ts": "Attempts basic text extraction from PDFs using FileReader and returns fallback messages on failure.",
  "frontend/src/lib/proInterviewer/metrics.ts": "Computes answer metrics such as filler count, sentence stats, and derives aggregated interview metrics.",
  "frontend/src/lib/proInterviewer/questionGenerator.ts": "Generates interview questions based on extracted document data, manual notes, and mode-specific logic like DAF questions.",
  "frontend/src/lib/proInterviewer/sessionReport.ts": "Builds a session report with scoring, body‑language inference, logical consistency, and improvement areas.",
  "frontend/src/lib/proInterviewer/summarizeExtraction.ts": "Parses text to extract keywords, skills, education, roles, and achievement indicators using simple pattern matching.",
  "frontend/src/lib/reminders/dailyReminder.ts": "Implements daily reminder logic using Notifications API with fallback checks and localStorage tracking.",
  "frontend/src/lib/security/blockOpenAIRequests.ts": "Installs runtime guards to block fetch and XHR requests to OpenAI-related domains.",
  "frontend/src/lib/security/noOpenAIPolicy.ts": "Defines the policy prohibiting OpenAI/ChatGPT integration and lists allowed alternatives.",
  "frontend/src/lib/settings/localSettingsStorage.ts": "Handles reading, writing, and clearing local-only settings such as API keys and toggles.",
  "frontend/src/lib/settings/providerStatus.ts": "Determines provider connection status based on enable flags and API key format validation.",
  "frontend/src/lib/settings/validateKeys.ts": "Performs lightweight format validation checks for OpenAI and Gemini API keys.",
  "frontend/src/lib/teacherAI/explainSentenceLocally.ts": "Generates rule-based grammar and vocabulary explanations entirely on-device.",
  "frontend/src/lib/tts/speakText.ts": "Provides text‑to‑speech playback with voice selection and error handling using the SpeechSynthesis API.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/ComingSoonPage.tsx": "Renders a Coming Soon UI page with navigation back to the home screen.",
  "frontend/src/pages/Day1LearningHubPage.tsx": "Renders Day 1 lesson hub with dictionary, grammar story mode, clickable text, and AI teacher explanations.",
  "frontend/src/pages/Day1TestPage.tsx": "Provides Day 1 test with MCQs and an essay, scoring logic, and result effects with pass/fail feedback.",
  "frontend/src/pages/FriendChatPage.tsx": "Implements an AI friend chat with text/voice input, grammar correction, message analysis, and offline tutor replies.",
  "frontend/src/pages/HomePage.tsx": "Displays main navigation grid linking to news, chat, course, tests, progress, and interview modules.",
  "frontend/src/pages/MyProgressPage.tsx": "Shows user progress including completed/unlocked days, streaks, badges, and interview report data.",
  "frontend/src/pages/NewsPage.tsx": "Displays regional news sections with TTS, refresh support, demo mode notice, and link-paste reader.",
  "frontend/src/pages/ProAIInterviewerPage.tsx": "Implements a multi‑step AI interview flow with file upload, text extraction, question generation, speech input, coaching, metrics, and session report saving.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI for configuring API keys, model settings, and daily reminder notifications stored locally in the browser.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins for animations and typography.",
  "project_state.json": "Describes project state, planned features, and issues focused on improving an English-learning AI assistant’s behavior and context awareness."
}