{
  "backend/main.mo": "Actor that fetches and caches GNews API results per region, refreshing data daily and exposing getNews and forceRefreshNews methods.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, news, and coming-soon pages and provides global layout.",
  "frontend/src/components/news/NewsItemRow.tsx": "Renders a numbered news item with headline and preview text.",
  "frontend/src/components/news/NewsSection.tsx": "Displays a region’s news with loading, error, gated, and demo-mode behavior using UI components.",
  "frontend/src/config/newsDataSource.ts": "Toggle between demo and backend data sources for news fetching.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor, updating when the user's identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hook to fetch region news, disabled when demo mode is active.",
  "frontend/src/hooks/useRegionNews.ts": "Provides a hook to fetch, parse, cache, and manage region-specific news with demo mode support and Israel verification handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/news/demoNewsData.ts": "Contains static demo news items for each region for development or offline use.",
  "frontend/src/lib/news/parseNews.ts": "Parses GNews JSON responses into clean news items with basic error handling and text sanitization.",
  "frontend/src/lib/news/regionConfig.ts": "Exports the list of supported regions with IDs, names, and flag icons.",
  "frontend/src/main.tsx": "Initializes React, sets up React Query and identity provider, and renders the main App.",
  "frontend/src/pages/ComingSoonPage.tsx": "Renders a placeholder page indicating a feature is under development with navigation back home.",
  "frontend/src/pages/HomePage.tsx": "Displays the home screen with navigation cards to news and upcoming features.",
  "frontend/src/pages/NewsPage.tsx": "Shows world news sections for all regions with refresh support and demo mode messaging.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing a mobile app with a beginner-friendly home screen, demo News sections, and architectural notes for future API-backed news fetching."
}