{
  "backend/main.mo": "Motoko canister managing user profiles, test attempts, course progress, news caching, and access control with role-based authorization.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their functionality and recent changes.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions for theming, including light/dark mode color tokens and base styling.",
  "frontend/index.html": "Base HTML entrypoint loading fonts, setting metadata, and mounting the root React app.",
  "frontend/src/App.tsx": "Main React app router configuration defining all routes and installing an OpenAI request blocker at startup.",
  "frontend/src/components/friendChat/ChatGPTUnavailableNotice.tsx": "Alert component explaining built‑in on-device chat assistant behavior and power mode status.",
  "frontend/src/components/news/NewsItemRow.tsx": "News item row component showing a headline, preview, and per-item TTS play/stop controls with error handling.",
  "frontend/src/components/news/NewsSection.tsx": "Renders region-specific news with loading, error, empty, and populated states using a news hook.",
  "frontend/src/components/news/TopUSHeadlinesSection.tsx": "Fetches and displays top US headlines with parsing, loading, error, and empty states.",
  "frontend/src/components/proInterviewer/BottomMicControl.tsx": "Provides a floating microphone toggle button with visual listening indicators.",
  "frontend/src/components/test/ResultEffects.tsx": "Shows a full-screen confetti animation when enabled using a canvas animation loop.",
  "frontend/src/config/newsDataSource.ts": "Configuration for switching between demo and backend news data sources.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAiMode.ts": "Determines whether AI mode should be used based on key validity and tracks connection errors.",
  "frontend/src/hooks/useCourseProgress.ts": "Hooks for fetching and updating user profile and course progress via backend actor APIs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and identity state management.",
  "frontend/src/hooks/useLocalSettings.ts": "React hook that loads and updates browser‑local API keys and settings with storage sync.",
  "frontend/src/hooks/usePowerMode.ts": "Manages a locally stored OpenAI key, validates its format, and exposes Power Mode state.",
  "frontend/src/hooks/useQueries.ts": "Provides react‑query hooks for fetching and refreshing backend region news, mainly India.",
  "frontend/src/hooks/useRegionNews.ts": "Fetches, parses, and caches region news with demo‑mode overrides and timestamps, plus a bulk refetch helper.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements browser‑only speech recognition using the Web Speech API with transcript and error callbacks.",
  "frontend/src/hooks/useUSNews.ts": "React‑query hooks for fetching and refreshing general US news through the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS config defining color variables, typography, and custom animation utilities.",
  "frontend/src/lib/course/day1LessonContent.ts": "Static lesson content for day 1 covering grammar basics, vocabulary, essay guidance, and a short reading passage.",
  "frontend/src/lib/course/day1TestQuestions.ts": "Exports multiple‑choice test questions for day 1 focused on basic English grammar.",
  "frontend/src/lib/course/essayGrammarCheck.ts": "Runs each essay line through detectAndCorrect and returns error counts plus formatted correction entries.",
  "frontend/src/lib/course/essayPowerModeFeedback.ts": "Generates enhanced grammar corrections, structural suggestions, and an overall score for essay lines.",
  "frontend/src/lib/friendChat/types.ts": "Defines the ChatMessage interface for user and tutor messages with metadata.",
  "frontend/src/lib/friendTutor/analyzeUserMessage.ts": "Analyzes grammar, tone, vocabulary, and power-answer opportunities for a user message.",
  "frontend/src/lib/friendTutor/detectAndCorrect.ts": "Applies regex‑based grammar rules to detect and auto-correct common English mistakes.",
  "frontend/src/lib/friendTutor/generatePowerTutorReply.ts": "Generates detailed Power Mode tutor replies with safety checks and context-based responses.",
  "frontend/src/lib/friendTutor/generateTutorReply.ts": "Creates normal tutor replies with safety filtering and optional analysis-based tips.",
  "frontend/src/lib/friendTutor/powerAnswers.ts": "Detects simple phrases and provides stronger alternative expressions for power‑up suggestions.",
  "frontend/src/lib/friendTutor/progressReport.ts": "Tracks session stats and generates a formatted progress report summarizing improvements.",
  "frontend/src/lib/news/demoNewsData.ts": "Defines static demo news items for several regions with headlines and previews.",
  "frontend/src/lib/news/parseNews.ts": "Parses GNews JSON into cleaned NewsItem objects and handles errors or empty responses.",
  "frontend/src/lib/news/regionConfig.ts": "Provides region metadata including IDs, names, and flag icons.",
  "frontend/src/lib/powerMode/powerModeStorage.ts": "Implements localStorage helpers for saving, retrieving, and clearing the OpenAI API key.",
  "frontend/src/lib/powerMode/validateOpenAIKey.ts": "Validates OpenAI API key format, ensuring non-empty keys start with 'sk-'.",
  "frontend/src/lib/proInterviewer/coachAnswer.ts": "Generates coaching feedback for interview answers including grammar correction, pronunciation hints, and pro tips.",
  "frontend/src/lib/proInterviewer/documentTypes.ts": "Defines interfaces for uploaded documents, extraction results, interview data, feedback, and metrics utilities.",
  "frontend/src/lib/proInterviewer/extractTextFromImage.ts": "Stubbed image OCR function that returns failure due to missing OCR library.",
  "frontend/src/lib/proInterviewer/extractTextFromPdf.ts": "Attempts basic PDF text extraction using FileReader and fallback messaging when extraction is insufficient.",
  "frontend/src/lib/proInterviewer/metrics.ts": "Computes answer metrics such as sentence stats and filler counts and aggregates them across answers.",
  "frontend/src/lib/proInterviewer/questionGenerator.ts": "Builds interview questions from extracted document data, manual notes, and optional DAF mode rules.",
  "frontend/src/lib/proInterviewer/sessionReport.ts": "Generates a session report by scoring logic, clarity, grammar, and filler usage, and builds narrative feedback and improvement areas.",
  "frontend/src/lib/proInterviewer/summarizeExtraction.ts": "Extracts keywords, skills, education, roles, and achievement indicators from text using simple pattern matching.",
  "frontend/src/lib/security/blockOpenAIRequests.ts": "Implements runtime guards that block fetch/XHR requests to OpenAI domains and prevent unauthorized API key use.",
  "frontend/src/lib/security/noOpenAIPolicy.ts": "Defines a policy disallowing OpenAI integration and lists permitted client-side alternatives.",
  "frontend/src/lib/settings/localSettingsStorage.ts": "Manages storing, retrieving, and clearing app settings in browser localStorage, including API keys and links.",
  "frontend/src/lib/settings/validateKeys.ts": "Validates format of OpenAI and Gemini API keys using basic length and pattern checks.",
  "frontend/src/lib/tts/speakText.ts": "Provides text‑to‑speech utilities with voice selection, cleanup, and error handling.",
  "frontend/src/main.tsx": "Initializes the React app root with query client and Internet Identity provider.",
  "frontend/src/pages/ComingSoonPage.tsx": "Renders a generic 'Coming Soon' page with feature name and navigation back home.",
  "frontend/src/pages/Day1LearningHubPage.tsx": "Displays Day 1 course content including grammar, vocabulary, and essay material with navigation.",
  "frontend/src/pages/Day1TestPage.tsx": "Renders a 200‑question Day 1 test with navigation, scoring, visual effects, and score submission to backend.",
  "frontend/src/pages/FriendChatPage.tsx": "Provides a chat interface with an AI friend using text or speech input and generates offline tutor replies.",
  "frontend/src/pages/HomePage.tsx": "Displays the main navigation hub with cards linking to news, chat, course, tests, progress, and interview tools.",
  "frontend/src/pages/MyProgressPage.tsx": "Shows user authentication gate and a 60‑day progress dashboard including completed and unlocked days.",
  "frontend/src/pages/NewsPage.tsx": "Displays regional news sections with optional demo mode and supports manual refresh.",
  "frontend/src/pages/ProAIInterviewerPage.tsx": "Implements a multi‑step AI interview simulator with document upload, text extraction, question generation, speech input, and session reporting.",
  "frontend/src/pages/SettingsPage.tsx": "React settings page allowing users to configure and locally store API keys and external links with UI cards and alerts.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, animations, and plugin setup for the frontend.",
  "project_state.json": "Project state file tracking current features, known issues, and redesign requirements for the UPSC prep app."
}