{
  "backend/main.mo": "Actor providing cached US and India news via HTTP outcalls, refreshing daily and storing results in a Map.",
  "backend/migration.mo": "Migration module filtering old cached news to retain only the 'us_general' entry during upgrade.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend files for reference.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Basic HTML wrapper loading the React application entrypoint.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, news, and coming-soon pages.",
  "frontend/src/components/news/NewsItemRow.tsx": "Displays a single news item row with index, headline, and preview text.",
  "frontend/src/components/news/NewsSection.tsx": "Card component showing a region’s news with loading, empty, and error states using useRegionNewsData.",
  "frontend/src/components/news/TopUSHeadlinesSection.tsx": "Home-page section fetching and displaying top US headlines with parse, loading, error, and empty handling.",
  "frontend/src/config/newsDataSource.ts": "Config toggling between demo and backend news sources via a global constant.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing an authenticated or anonymous backend actor, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, storing identity state, and handling AuthClient creation and lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines react‑query hooks for fetching and refreshing region news through the backend actor, with demo‑mode handling.",
  "frontend/src/hooks/useRegionNews.ts": "Wraps backend news queries with parsing, demo‑mode data, last‑updated tracking, and a helper to refresh all regions.",
  "frontend/src/hooks/useUSNews.ts": "Implements react‑query hooks for fetching and refreshing US news from the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/news/demoNewsData.ts": "Provides deterministic demo news items for all regions for development and testing.",
  "frontend/src/lib/news/parseNews.ts": "Parses GNews JSON into normalized news items, handling errors, HTML cleanup, and preview generation.",
  "frontend/src/lib/news/regionConfig.ts": "Exports the list of supported regions with IDs, names, and flags.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react‑query and Internet Identity providers.",
  "frontend/src/pages/ComingSoonPage.tsx": "Renders a generic 'Coming Soon' UI with navigation back to home.",
  "frontend/src/pages/HomePage.tsx": "Home screen showing header, US headlines, and navigation cards linking to News, Vocabulary, Speaking, and Lessons pages.",
  "frontend/src/pages/NewsPage.tsx": "News screen that displays world news by region with refresh controls and demo mode handling.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, fonts, animations, and plugins.",
  "project_state.json": "Project state metadata describing news app features, known issues, and pending feature requests related to regional news loading."
}