{
  "backend/main.mo": "Main backend actor defining user profiles, test handling, course progress, news cache, and progress reports with access control and migration hook.",
  "backend/migration.mo": "Migration module converting old actor state to the new structure by adding an empty progressReports map.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Tailwind base styles and design tokens defining light/dark theme colors and global UI variables.",
  "frontend/index.html": "HTML entry point loading fonts, setting metadata, and mounting the React root.",
  "frontend/src/App.tsx": "App router setup defining all application routes and installing the OpenAI request blocker.",
  "frontend/src/components/course/StoryModeTopicCard.tsx": "UI card component displaying story-mode details for a lesson topic or vocabulary word.",
  "frontend/src/components/friendChat/ChatGPTUnavailableNotice.tsx": "Alert component showing built-in assistant or power mode notice with dynamic styling.",
  "frontend/src/components/news/NewsFallbackInAppBrowser.tsx": "Provides a fallback UI to enter, validate, save, and open a custom news URL in an iframe when region news is unavailable.",
  "frontend/src/components/news/NewsItemRow.tsx": "Renders a news item with headline, preview, and a text‑to‑speech play/stop control.",
  "frontend/src/components/news/NewsSection.tsx": "Displays region-specific news with loading, error, empty, and content states, using NewsItemRow or a fallback browser.",
  "frontend/src/components/news/TopUSHeadlinesSection.tsx": "Shows top US headlines with loading, error, empty, and parsed news display using NewsItemRow.",
  "frontend/src/components/progress/MistakeTracker.tsx": "Displays learned items and improvement areas from useMistakeTracker with loading and empty states.",
  "frontend/src/components/proInterviewer/BottomMicControl.tsx": "Floating microphone toggle button that visually indicates active recording state.",
  "frontend/src/components/test/ResultEffects.tsx": "Shows a confetti animation on a fullscreen canvas when enabled.",
  "frontend/src/config/newsDataSource.ts": "Config toggling between demo and backend news data sources.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, invalidating related queries on change.",
  "frontend/src/hooks/useAiMode.ts": "Determines whether AI mode is active based on key validity and connection status, with error handling utilities.",
  "frontend/src/hooks/useCourseProgress.ts": "React Query hooks for fetching and mutating user profiles, course progress, day lock states, and submitting test scores via an actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useInterviewReports.ts": "Hooks for retrieving and adding interview analysis reports through backend actor calls, with query invalidation.",
  "frontend/src/hooks/useLocalSettings.ts": "Manages browser-local settings such as API keys and provider status, with helpers to update and compute provider states.",
  "frontend/src/hooks/useMistakeTracker.ts": "Loads, updates, and persists mistake-tracker data in local storage using a simple state hook.",
  "frontend/src/hooks/usePowerMode.ts": "Handles local storage and validation of an OpenAI API key to determine Power Mode activation without transmitting data.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching region-specific news and forcing refreshes through backend actor methods.",
  "frontend/src/hooks/useRegionNews.ts": "Wraps news queries with region mapping, parsing, demo-mode behavior, timestamp tracking, and bulk refetch controls.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements local speech-to-text recognition using the Web Speech API with event handling and no external data transmission.",
  "frontend/src/hooks/useUSNews.ts": "Provides React Query hooks to fetch and refresh US news via an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, and utility classes including glassmorphism and neon effects.",
  "frontend/src/lib/course/day1LessonContent.ts": "Stores Day 1 lesson content including grammar topics and vocabulary with story-based explanations.",
  "frontend/src/lib/course/day1TestQuestions.ts": "Contains multiple‑choice test questions for Day 1 focused on is/am/are usage.",
  "frontend/src/lib/course/essayGrammarCheck.ts": "Checks essay lines for grammar errors using detectAndCorrect and returns correction details.",
  "frontend/src/lib/course/essayPowerModeFeedback.ts": "Generates enhanced essay feedback with corrections, suggestions, and a score.",
  "frontend/src/lib/course/types.ts": "Defines shared types for lesson topics, story mode sections, and vocabulary words.",
  "frontend/src/lib/friendChat/types.ts": "Defines the ChatMessage structure for user–tutor chat interactions.",
  "frontend/src/lib/friendTutor/analyzeUserMessage.ts": "Analyzes user messages for grammar, tone, vocabulary, and power answers.",
  "frontend/src/lib/friendTutor/detectAndCorrect.ts": "Implements rule‑based grammar detection and correction for simple English mistakes.",
  "frontend/src/lib/friendTutor/generatePowerTutorReply.ts": "Generates enhanced, on-device tutor replies with safety checks and detailed responses based on message patterns. Handles greetings, farewells, questions, short messages, and long messages.",
  "frontend/src/lib/friendTutor/generateTutorReply.ts": "Produces tutor replies with personality modes and basic safety filtering. Includes pattern-based responses for greetings, farewells, questions, and gratitude.",
  "frontend/src/lib/friendTutor/powerAnswers.ts": "Defines regex rules for detecting simple phrases and suggesting more advanced alternatives. Exposes a function that returns the first matching power-up suggestion.",
  "frontend/src/lib/friendTutor/progressReport.ts": "Tracks session facts such as grammar corrections, tone, and vocabulary suggestions, and generates a formatted progress report. Provides helpers to initialize and update session data.",
  "frontend/src/lib/news/demoNewsData.ts": "Provides deterministic demo news items for several regions. Used as placeholder data during development and testing.",
  "frontend/src/lib/news/fallbackNewsUrlStorage.ts": "Stores, retrieves, and clears region-specific fallback news URLs in localStorage with error handling.",
  "frontend/src/lib/news/parseNews.ts": "Parses GNews API JSON responses into clean news items with sanitized previews. Handles API errors and malformed or empty input safely.",
  "frontend/src/lib/news/regionConfig.ts": "Defines available news regions with IDs, names, and flags. Exports a static list of region configurations.",
  "frontend/src/lib/news/validateHttpUrl.ts": "Validates and normalizes HTTP/HTTPS URLs, enforcing allowed protocols and returning descriptive errors. Auto-prepends https:// when missing.",
  "frontend/src/lib/powerMode/powerModeStorage.ts": "Manages localStorage persistence of the user's OpenAI API key, ensuring it remains client-side only.",
  "frontend/src/lib/powerMode/validateOpenAIKey.ts": "Validates OpenAI API key format, allowing empty keys and requiring non-empty keys to start with 'sk-'.",
  "frontend/src/lib/progress/mistakeTrackerStorage.ts": "Provides localStorage helpers for reading and saving Mistake Tracker items.",
  "frontend/src/lib/proInterviewer/coachAnswer.ts": "Provides grammar correction, filler-word detection, pronunciation guidance, and category-based pro tips for an interview answer.",
  "frontend/src/lib/proInterviewer/documentTypes.ts": "Defines interfaces for uploaded documents, extracted data, interview questions, feedback, metrics, and utility to format file sizes.",
  "frontend/src/lib/proInterviewer/extractTextFromImage.ts": "Returns a failure response for OCR since no OCR library is available, instructing users to provide manual text input.",
  "frontend/src/lib/proInterviewer/extractTextFromPdf.ts": "Performs basic PDF text extraction via FileReader and TextDecoder, returning fallback text if extraction fails.",
  "frontend/src/lib/proInterviewer/metrics.ts": "Computes logic, clarity, filler count, and sentence metrics from a transcript and aggregates multiple metric sets.",
  "frontend/src/lib/proInterviewer/questionGenerator.ts": "Generates interview questions from extracted document data, manual notes, and optional DAF mode with UPSC-style prompts.",
  "frontend/src/lib/proInterviewer/sessionReport.ts": "Builds a session report with scoring, body‑language inference, logical consistency notes, and improvement suggestions.",
  "frontend/src/lib/proInterviewer/summarizeExtraction.ts": "Extracts keywords, skills, education, roles, and achievements from raw text using pattern matching.",
  "frontend/src/lib/security/blockOpenAIRequests.ts": "Installs runtime guards blocking fetch/XHR requests to OpenAI domains for security compliance.",
  "frontend/src/lib/security/noOpenAIPolicy.ts": "Documents the policy forbidding OpenAI API integration and lists allowed client‑side alternatives.",
  "frontend/src/lib/settings/localSettingsStorage.ts": "Provides localStorage-based getters and setters for API keys and feature toggles, plus a clear-all helper.",
  "frontend/src/lib/settings/providerStatus.ts": "Determines provider connection status based on enable flags and API key validation results.",
  "frontend/src/lib/settings/validateKeys.ts": "Implements lightweight format checks for OpenAI and Gemini API keys without network calls.",
  "frontend/src/lib/tts/speakText.ts": "Wrapper around browser speechSynthesis to speak text with cleanup, voice selection, and error handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ComingSoonPage.tsx": "Renders a generic coming-soon page with feature name display and a back-to-home button.",
  "frontend/src/pages/Day1LearningHubPage.tsx": "Displays Day 1 course content including grammar, vocabulary, and essay sections with navigation to the test.",
  "frontend/src/pages/Day1TestPage.tsx": "Implements Day 1 quiz flow, score calculation, effects, and backend score submission.",
  "frontend/src/pages/FriendChatPage.tsx": "Provides an AI friend chat interface with speech-to-text, grammar correction, and offline tutor reply generation.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard rendering navigation buttons linking to core app features and top US headline news.",
  "frontend/src/pages/MyProgressPage.tsx": "Displays user progress for the 60‑day course with stats, interview reports, and loading states.",
  "frontend/src/pages/NewsPage.tsx": "Shows regional news sections with optional demo mode and supports refreshing all news feeds.",
  "frontend/src/pages/ProAIInterviewerPage.tsx": "Guides users through uploading materials, running an AI‑driven interview, recording answers, and generating a session report.",
  "frontend/src/pages/SettingsPage.tsx": "Settings interface for managing local API keys, feature toggles, and app configuration stored in local storage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters for routing and state persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, custom colors, fonts, shadows, keyframes, and animations for the frontend UI.",
  "project_state.json": "Project state file tracking feature requirements, summaries, and pending requests for news fallback URLs and the Interview feature workflow."
}