{
  "kind": "build_request",
  "title": "Configure Button 4 as Day-wise 200-Mark Testing System with essay and new passing rules",
  "projectName": "Pass English Speaking",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Day 1 test (Button 4 / route \"/day1-test\") to render a strict but fair test as a clear, scrollable list of questions (not one-question-per-page), where every question includes a visible topic label in the format \"[Topic: …]\" (e.g., \"[Topic: Grammar - Is/Am/Are]\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Design: Use a clear list for questions and a large, clean text area for the Essay.",
          "Every question must have a label (e.g., '[Topic: Grammar - Is/Am/Are]')."
        ]
      },
      "acceptanceCriteria": [
        "The Day 1 test page shows all questions in a list layout with each question preceded by a topic label like \"[Topic: Grammar - Is/Am/Are]\".",
        "The user can answer questions in-place within the list and submit the test from the bottom of the page."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement day-wise question generation for Button 4 such that the test questions for a given day are generated ONLY from the topics taught in Button 3 for that same day (starting with Day 1 content from the existing Day 1 learning hub content). The question set must not include topics that are not taught on that day.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Generate questions ONLY based on the topics taught in Button 3 (Day-wise)."
        ]
      },
      "acceptanceCriteria": [
        "For Day 1, questions are generated only from Day 1 learning content topics (e.g., grammar Is/Am/Are and Day 1 vocabulary/essay content), and do not include unrelated topics (e.g., no A/An/The questions if not taught in Day 1 lessons).",
        "Question generation is driven by day-specific lesson content rather than a hard-coded unrelated question bank."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an \"Essay Writing\" section at the end of the Day 1 test with a large, clean text area for the user to type their essay, and include the essay as part of scoring worth exactly 20 marks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Add an 'Essay Writing' box at the end of the test.\nThis section is worth 20 Marks.",
          "Design: Use a clear list for questions and a large, clean text area for the Essay."
        ]
      },
      "acceptanceCriteria": [
        "The test page ends with an \"Essay Writing\" section containing a large text area input.",
        "The final test score calculation includes an essay component worth exactly 20 marks."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update test scoring and pass/fail feedback rules for Button 4: Total Marks must be exactly 200; the passing threshold must be 150/200 to unlock the next day. If the user scores below 50, show exactly: \"Fail! Please review Day [Current Day] stories again.\" If the user scores 150+, show exactly: \"Success! Day [Next Day] is now unlocked.\" All user-facing text must be in English.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Total Marks = 200.\nPassing Criteria: User only needs 150/200 to unlock the next Day.\nFeedback: >    * If the user scores below 50, show: 'Fail! Please review Day [Current Day] stories again.'\nIf the user scores 150+, show: 'Success! Day [Next Day] is now unlocked.'",
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "The computed total score is always presented out of 200.",
        "Submitting a score >= 150 triggers an unlock of the next day in persisted course progress.",
        "If score < 50, the results UI shows exactly: \"Fail! Please review Day 1 stories again.\" (for Day 1).",
        "If score >= 150, the results UI shows exactly: \"Success! Day 2 is now unlocked.\" (for Day 1).",
        "No non-English or emoji content is used in these feedback strings."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the backend test submission and course progress logic so that passing is based on score >= 150 out of 200 (not perfect score), and so that the unlock behavior works for the current day (starting with Day 1 unlocking Day 2). Ensure existing persisted state is migrated safely if backend state structures change.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Passing Criteria: User only needs 150/200 to unlock the next Day."
        ]
      },
      "acceptanceCriteria": [
        "Backend persists the submitted test attempt/score and updates the caller’s course progress to unlock the next day when score >= 150 (for Day 1: unlock Day 2).",
        "Backend returns a result message suitable for the frontend to display and/or frontend can deterministically display the required messages based on score and day.",
        "If a state schema change is required, a migration is implemented so existing users do not lose stored progress/test attempts."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update Button 4 copy and UI text that currently indicates perfect-score rules (e.g., \"Score 200/200 to unlock Day 2\") to reflect the new passing criteria (150/200) and new feedback behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Passing Criteria: User only needs 150/200 to unlock the next Day."
        ]
      },
      "acceptanceCriteria": [
        "Home page Button 4 description and the Day 1 test page header/description no longer claim 200/200 is required, and instead reflect 150/200 passing rules.",
        "The results screen no longer shows \"Perfect Score!\" / \"Test Failed\" logic tied to 200/200; it reflects pass/fail based on >=150, <50 messaging, and an appropriate non-pass/non-<50 state."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo (generate backend/migration.mo only if needed for state upgrade).",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT (compose existing UI components instead).",
    "Do not add any third-party authentication (Internet Identity only)."
  ],
  "nonGoals": [
    "Creating or populating full lesson/test content for days beyond Day 1 (only ensure the system is day-wise and Day 1 complies using existing Day 1 lesson topics).",
    "Adding real-time features (e.g., WebSockets) or external databases.",
    "Integrating external LLM APIs for question generation or essay scoring."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}