{
  "kind": "build_request",
  "title": "Add News fallback in-app browser and Interview uploads with saved performance reports",
  "projectName": "Pass English Speaking",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When a news region has no available news items (i.e., the News section is in its empty state), render a URL input field that lets the user paste a news website link and open that link inside the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Button 1: If news is unavailable for a country, add a 'URL Input' box so I can paste a news website link to open inside the app."
        ]
      },
      "acceptanceCriteria": [
        "In News sections where the list is empty, the UI includes a labeled URL input and an \"Open\" action.",
        "Entering a valid http/https URL and clicking \"Open\" displays the target site inside the app (not via a new tab).",
        "If the URL is invalid or empty, the user sees an English validation message and the in-app view is not opened.",
        "The fallback UI does not appear while news is loading or when an error state is shown."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Persist the user-provided fallback news URL per region (country/region section) so that returning to the News page restores the previously entered URL for that region.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "If news is unavailable for a country, add a 'URL Input' box so I can paste a news website link to open inside the app."
        ]
      },
      "acceptanceCriteria": [
        "After a user enters a fallback URL for a region and navigates away/back, the input is pre-filled for that same region.",
        "Changing the fallback URL updates the persisted value for that region only.",
        "A user can clear the fallback URL for a region and it remains cleared on refresh."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Rename Button 6 on the Home page from \"UPSC Interview\" to \"Interview\" and ensure all user-facing text for this feature uses \"Interview\" terminology.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Button 6: Rename to 'Interview'."
        ]
      },
      "acceptanceCriteria": [
        "Home page navigation tile label reads \"Interview\".",
        "The Interview page header/title and any navigation labels do not refer to \"UPSC Interview\" (unless it is part of the content being practiced); use \"Interview\" as the feature name."
      ]
    },
    {
      "id": "REQ-4",
      "text": "In the Interview feature, allow uploading PDF and image files and extract text from the uploaded file to generate interview questions from that extracted content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Allow me to upload PDF/Images. The AI must extract questions from my file."
        ]
      },
      "acceptanceCriteria": [
        "The Interview upload step accepts .pdf and image/* files.",
        "For PDFs, extracted text is derived from the uploaded PDF and used to generate questions.",
        "For images, the app attempts to extract text from the uploaded image and uses it to generate questions; if extraction fails, the UI clearly prompts the user (in English) to provide manual text as a fallback.",
        "Generated questions are shown to the user before beginning the interview step."
      ]
    },
    {
      "id": "REQ-5",
      "text": "In the Interview answering step, provide a text box for answers and a microphone button that includes an upload icon, enabling speech-to-text capture into the answer text box.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add a Text box and a Mic button (with an upload icon) for my answers."
        ]
      },
      "acceptanceCriteria": [
        "The Interview step includes an answer text area for typed/pasted responses.",
        "A mic control is present that visually includes an upload icon as requested, and toggling it starts/stops speech recognition.",
        "Final speech transcripts are appended into the answer text box; interim transcripts are shown during recording.",
        "All labels/placeholders/errors are in English."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Store the user's Interview performance analysis into the Progress Report area so the user can review it later from the Progress page.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Send my performance analysis to the Progress Report."
        ]
      },
      "acceptanceCriteria": [
        "After completing an Interview session and generating the final performance analysis/report, the app saves that report to the backend under the authenticated user.",
        "The Progress page displays the saved Interview performance analysis (at minimum: most recent report) in a dedicated section.",
        "If the user is not logged in, the app does not attempt to save the report and shows an English message indicating login is required to save progress.",
        "Backend exposes query/update methods needed to save and fetch Interview reports for the current caller, protected by existing authorization checks."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not modify any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding third-party LLM integrations or OpenAI/ChatGPT requests for question extraction/analysis.",
    "Implementing real-time features (WebSockets) or push notifications.",
    "Building a full web browser; only a simple in-app embedded view for a user-provided URL is required."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}