{
  "kind": "build_request",
  "title": "UPSC Interview Mic/Speaking UI + Vibrant Glassmorphism Redesign",
  "projectName": "Pass English Speaking",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the UPSC Interview (Button 6) interview step UI so microphone and speaking controls are clearly visible and usable: add a large, prominent, colorful microphone button fixed at the bottom center of the interview screen; clicking it toggles voice recording; show a small green status-light indicator when the microphone is active/ready.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix the UI for Button 6 (UPSC Interview). The 'Speaking' and 'Mic' features are currently missing or not visible.",
          "Add a Large Mic Button: Place a prominent, colorful Microphone icon at the bottom center of the interview screen.",
          "Voice Activation: When the user clicks the Mic, it should start recording",
          "Status Indicator: Show a small green light icon when the Mic is active and ready."
        ]
      },
      "acceptanceCriteria": [
        "On /pro-ai-interviewer during the 'interview' step, there is a large microphone control fixed to the bottom center of the viewport and it is visible without scrolling.",
        "Clicking the large microphone control starts/stops speech recognition using the existing browser-only Web Speech API hook.",
        "When recording is active, a green status indicator is visible (and not visible or clearly inactive when the mic is off).",
        "The previous mic controls are not duplicated in a confusing way (either removed or visually demoted so the large mic is the primary control)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a visible 'Listening...' state to the UPSC Interview microphone interaction: while the mic is active, show a 'Listening...' animation resembling moving waves near the mic control, and show live speech-to-text on screen in a chat bubble as the user speaks (including interim/partial speech updates).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When the user clicks the Mic, it should start recording and show a 'Listening...' animation (like moving waves).",
          "Speech-to-Text Display: As the user speaks, their words should appear on the screen in a chat bubble so they can see what they are saying."
        ]
      },
      "acceptanceCriteria": [
        "When the mic is active on the interview step, a 'Listening...' indicator with an animated wave effect is shown.",
        "As the user speaks, their recognized words appear in a chat-bubble style element in the interview UI (not only inside the textarea).",
        "Interim speech recognition results update the chat bubble in near real-time; final results are preserved/committed to the answer state.",
        "If speech recognition is unsupported or permission is denied, the UI shows an error via the existing toast behavior and the mic UI returns to an inactive state."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an explicit AI 'Speak' control in the UPSC Interview flow so the user can clearly trigger text-to-speech playback of the current panel question (separate from the microphone control), using the existing browser-only TTS utility.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Real-time Speaking: Add a 'Speak' button for the AI so the user can hear the UPSC panel's questions clearly."
        ]
      },
      "acceptanceCriteria": [
        "On the interview step, there is a clearly labeled control with user-facing text 'Speak' (or 'Speak Question') that plays the current question via text-to-speech.",
        "While TTS playback is active, the UI reflects the speaking state (e.g., disabled button and/or 'Speaking...' label) without hiding the mic button.",
        "TTS uses the existing speakText/stopSpeaking utilities and remains browser-only (no external requests)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Redesign the Home dashboard to a modern, colorful, vibrant Glassmorphism theme with a soft gradient background from Light Blue to Soft Purple, and update the six primary dashboard buttons to use the specified per-button color palette and emoji icons (📰 🤖 📚 🏆 📈 🏛️) while keeping their existing routes and labels in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Give my app a modern, colorful, and vibrant look",
          "Dashboard Theme: Use a clean Glassmorphism effect with a soft gradient background (Light Blue to Soft Purple).",
          "Button Styling (Colorful Palette): Button 1 (News): Vibrant Ocean Blue with a 📰 icon. Button 2 (AI Friend): Bright Emerald Green with a 🤖 icon. Button 3 (Course): Energetic Sunset Orange with a 📚 icon. Button 4 (Test): Bold Royal Red with a 🏆 icon. Button 5 (Progress): Calming Teal with a 📈 icon. Button 6 (UPSC): Premium Golden/Deep Purple with a 🏛️ icon."
        ]
      },
      "acceptanceCriteria": [
        "The HomePage background uses a light-blue to soft-purple gradient and the button cards use a glassmorphism look (blurred/translucent surface, subtle border, soft shadow).",
        "Each of the 6 dashboard buttons displays the specified emoji icon and uses a distinct, vibrant color style consistent with the requested palette.",
        "Button click behavior still navigates to the existing routes: /news, /chat-with-friend, /day1-learn, /day1-test, /my-progress, /pro-ai-interviewer.",
        "All user-facing text remains English."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update global typography to use a bold, rounded font such as Poppins or Montserrat consistently across the app UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Typography: Use a bold, rounded font like 'Poppins' or 'Montserrat' to make it look friendly and easy to read."
        ]
      },
      "acceptanceCriteria": [
        "The app loads and applies Poppins or Montserrat as the primary sans-serif font (with sensible system fallbacks).",
        "Headings and primary UI text render using the updated font across major pages (Home, Test, Progress, UPSC Interview)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add visual feedback animations for the 200-mark test result: when the user passes with a perfect score (200/200), show a colorful confetti animation; when the user fails, apply a gentle red shake effect to the page (or main test container) upon result display.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Visual Feedback: When a user Passes (200/200), show a Confetti Animation (colorful patakhe). When a user Fails, show a gentle Red Shake effect on the screen."
        ]
      },
      "acceptanceCriteria": [
        "After submitting the Day 1 test, if score === 200, a confetti animation appears automatically and is clearly visible.",
        "After submitting the Day 1 test, if score < 200, the screen (or main container) performs a gentle red shake animation when the result is shown.",
        "Animations do not block navigation or prevent clicking the next actions (View Progress / Try Again)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all user-facing text in English.",
    "Speech-to-text and text-to-speech must remain browser-only (no external audio/transcript services)."
  ],
  "nonGoals": [
    "Do not add or change backend canister APIs or persistence for microphone/audio features.",
    "Do not introduce third-party auth beyond Internet Identity.",
    "Do not add external real-time services (e.g., WebSockets) for interview interactions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}