{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "News empty-state in-app URL browser + Interview uploads, mic UI update, and saved reports in Progress",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show a fallback URL input in empty News sections and open valid URLs inside the app.",
      "acceptanceCriteria": [
        "In News sections where the list is empty, the UI includes a labeled URL input and an \"Open\" action.",
        "Entering a valid http/https URL and clicking \"Open\" displays the target site inside the app (not via a new tab).",
        "If the URL is invalid or empty, the user sees an English validation message and the in-app view is not opened.",
        "The fallback UI does not appear while news is loading or when an error state is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/news/NewsSection.tsx",
          "operation": "modify",
          "description": "Replace the current empty-state Alert with a fallback UI that includes a labeled URL input + Open action, and renders an embedded in-app web view (e.g., iframe) only when a valid http/https URL is provided; ensure it only appears when !isLoading && !error && data.length===0."
        },
        {
          "path": "frontend/src/components/news/NewsFallbackInAppBrowser.tsx",
          "operation": "create",
          "description": "Create a reusable empty-state component that renders the labeled URL input, validation messaging (English), an Open action, and an in-app embedded view with a Close action. Use existing shadcn-ui primitives (e.g., Input/Button/Label/Card/Alert) without modifying anything under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/news/validateHttpUrl.ts",
          "operation": "create",
          "description": "Add a small utility to validate and normalize user-entered URLs to http/https only (returning a user-friendly English error message when invalid) to keep validation consistent across News sections."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persist the fallback News URL per region and restore it when returning to the News page.",
      "acceptanceCriteria": [
        "After a user enters a fallback URL for a region and navigates away/back, the input is pre-filled for that same region.",
        "Changing the fallback URL updates the persisted value for that region only.",
        "A user can clear the fallback URL for a region and it remains cleared on refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/news/fallbackNewsUrlStorage.ts",
          "operation": "create",
          "description": "Implement localStorage helpers to get/set/clear a fallback URL keyed by region id (country/region section), handling storage failures gracefully."
        },
        {
          "path": "frontend/src/components/news/NewsFallbackInAppBrowser.tsx",
          "operation": "modify",
          "description": "Wire region-scoped persistence: on mount load the saved URL for that region into the input; on change persist updates for that region only; allow clearing and persist the cleared state."
        },
        {
          "path": "frontend/src/components/news/NewsSection.tsx",
          "operation": "modify",
          "description": "Pass the current region id/name into the fallback browser component so persistence is scoped per region section."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Rename the Home tile and all feature labels from \"UPSC Interview\" to \"Interview\".",
      "acceptanceCriteria": [
        "Home page navigation tile label reads \"Interview\".",
        "The Interview page header/title and any navigation labels do not refer to \"UPSC Interview\" (unless it is part of the content being practiced); use \"Interview\" as the feature name."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update Button 6 (currently labeled \"UPSC Interview\") to display \"Interview\" and ensure its description/user-facing text uses the \"Interview\" feature name."
        },
        {
          "path": "frontend/src/pages/ProAIInterviewerPage.tsx",
          "operation": "modify",
          "description": "Update the page title/header and any other user-facing feature labels from \"UPSC Interview\" terminology to \"Interview\" (keeping any UPSC-specific wording only where it is clearly practice content, not the feature name)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Support PDF/image uploads in Interview and use extracted text to generate questions with clear image-extraction fallback guidance.",
      "acceptanceCriteria": [
        "The Interview upload step accepts .pdf and image/* files.",
        "For PDFs, extracted text is derived from the uploaded PDF and used to generate questions.",
        "For images, the app attempts to extract text from the uploaded image and uses it to generate questions; if extraction fails, the UI clearly prompts the user (in English) to provide manual text as a fallback.",
        "Generated questions are shown to the user before beginning the interview step."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProAIInterviewerPage.tsx",
          "operation": "modify",
          "description": "Ensure the upload step continues to accept .pdf and image/*; when an image upload extraction fails, show an in-page English prompt near the manual text input (not only a toast) guiding the user to paste/type their information; keep the existing flow that generates and displays questions in the review step before the interview begins."
        },
        {
          "path": "frontend/src/lib/proInterviewer/extractTextFromImage.ts",
          "operation": "modify",
          "description": "Adjust the image-extraction result shape/messages (without adding third-party OCR) so the UI can reliably detect failure and display a clear manual-text fallback prompt (English)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add/confirm typed answer box and update the Interview mic control to include an upload icon while supporting interim/final transcripts.",
      "acceptanceCriteria": [
        "The Interview step includes an answer text area for typed/pasted responses.",
        "A mic control is present that visually includes an upload icon as requested, and toggling it starts/stops speech recognition.",
        "Final speech transcripts are appended into the answer text box; interim transcripts are shown during recording.",
        "All labels/placeholders/errors are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/proInterviewer/BottomMicControl.tsx",
          "operation": "modify",
          "description": "Update the mic button UI to visually include an upload icon alongside/overlaid with the mic icon while preserving the existing start/stop toggle behavior and English helper text. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProAIInterviewerPage.tsx",
          "operation": "modify",
          "description": "Confirm the interview step includes a typed answer Textarea with English placeholder; ensure interim transcripts remain visible during recording and final transcripts continue appending into the answer text box."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Save Interview performance analysis to Progress Reports (when logged in) and display saved reports on the Progress page.",
      "acceptanceCriteria": [
        "After completing an Interview session and generating the final performance analysis/report, the app saves that report to the backend under the authenticated user.",
        "The Progress page displays the saved Interview performance analysis (at minimum: most recent report) in a dedicated section.",
        "If the user is not logged in, the app does not attempt to save the report and shows an English message indicating login is required to save progress.",
        "Backend exposes query/update methods needed to save and fetch Interview reports for the current caller, protected by existing authorization checks."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInterviewReports.ts",
          "operation": "create",
          "description": "Create React Query hooks that use the existing backend actor to (a) fetch the caller’s saved interview analyses for display in Progress and (b) submit new interview analysis entries after an interview completes. Leverage the existing authorization + Internet Identity flow so saves occur only when authenticated. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProAIInterviewerPage.tsx",
          "operation": "modify",
          "description": "After generating the final report, if the user is authenticated, submit the interview analysis/report to the backend via the actor (e.g., saving at least the most recent/overall report, and/or per-question feedback) and show an English confirmation/failure message; if not authenticated, do not save and show an English message indicating login is required to save progress (use the existing authorization/Internet Identity state; verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/pages/MyProgressPage.tsx",
          "operation": "modify",
          "description": "Add a dedicated \"Interview Reports\" section that loads and displays the most recent saved interview performance analysis for the current authenticated user (including question/answer/feedback as available), with appropriate loading/empty/error states in English."
        }
      ]
    }
  ]
}