{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Day-wise 200-Mark Gate (Day 1) list-based test with essay + updated passing rules",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render Day 1 test as a strict but fair, scrollable list of in-place questions with visible topic labels.",
      "acceptanceCriteria": [
        "The Day 1 test page shows all questions in a list layout with each question preceded by a topic label like \"[Topic: Grammar - Is/Am/Are]\".",
        "The user can answer questions in-place within the list and submit the test from the bottom of the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Day1TestPage.tsx",
          "operation": "modify",
          "description": "Replace the current one-question-per-page flow with a scrollable list layout that renders all generated questions at once, each preceded by a visible label formatted exactly like \"[Topic: …]\". Keep answers editable in-place and provide a single submit action at the bottom. Use existing shadcn-ui components (e.g., Card, Button, RadioGroup, Label) to compose the UI; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Generate Button 4 Day 1 test questions only from that day’s Button 3 lesson topics (Day 1 learning hub content).",
      "acceptanceCriteria": [
        "For Day 1, questions are generated only from Day 1 learning content topics (e.g., grammar Is/Am/Are and Day 1 vocabulary/essay content), and do not include unrelated topics (e.g., no A/An/The questions if not taught in Day 1 lessons).",
        "Question generation is driven by day-specific lesson content rather than a hard-coded unrelated question bank."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/course/dayWiseTestGenerator.ts",
          "operation": "create",
          "description": "Create a day-wise test generator that derives Day 1 questions strictly from frontend/src/lib/course/day1LessonContent.ts topics (Grammar: Is/Am/Are; Day 1 vocabulary words; Day 1 essay topic). Ensure the generated question objects include a topic string used for the \"[Topic: …]\" label and that the generated set totals 180 non-essay marks (to combine with the 20-mark essay for a 200-mark test)."
        },
        {
          "path": "frontend/src/pages/Day1TestPage.tsx",
          "operation": "modify",
          "description": "Switch Day 1 test data source from the existing hard-coded day1TestQuestions bank to the new day-wise generator so Day 1 includes only Day 1-taught topics. Ensure no A/An/The or other untaught topics appear. Use existing shadcn-ui components for rendering; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/course/day1TestQuestions.ts",
          "operation": "modify",
          "description": "Remove or clearly de-scope any Day 1 questions that cover untaught topics (e.g., A/An/The) so the repository no longer contains a misleading Day 1 test bank that violates day-wise rules. If this file remains for reference, align it strictly to Day 1 taught topics or make it an internal-only helper used by the day-wise generator."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an Essay Writing section at the end of the Day 1 test with a large text area and score it as exactly 20 marks.",
      "acceptanceCriteria": [
        "The test page ends with an \"Essay Writing\" section containing a large text area input.",
        "The final test score calculation includes an essay component worth exactly 20 marks."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/course/essayScoring.ts",
          "operation": "create",
          "description": "Implement a deterministic, on-device essay scoring helper that produces an integer score from 0 to 20 (exactly) using local checks (e.g., grammar/error heuristics based on existing utilities) and returns a breakdown suitable for UI display if needed. No external API/LLM calls."
        },
        {
          "path": "frontend/src/pages/Day1TestPage.tsx",
          "operation": "modify",
          "description": "Append an \"Essay Writing\" section after the last question with a large, clean text area input. Include the essay score (0–20) as a fixed 20-mark component of the final 200 mark total. Compose UI using existing components where available (e.g., Card, Label, Button, and a Textarea component if present); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update total scoring to exactly 200 and apply new pass/fail feedback rules (pass >=150; special fail message for <50) with English-only UI text.",
      "acceptanceCriteria": [
        "The computed total score is always presented out of 200.",
        "Submitting a score >= 150 triggers an unlock of the next day in persisted course progress.",
        "If score < 50, the results UI shows exactly: \"Fail! Please review Day 1 stories again.\" (for Day 1).",
        "If score >= 150, the results UI shows exactly: \"Success! Day 2 is now unlocked.\" (for Day 1).",
        "No non-English or emoji content is used in these feedback strings."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Day1TestPage.tsx",
          "operation": "modify",
          "description": "Update scoring so the final computed score is always out of 200 (180 marks from generated questions + exactly 20 from the essay). Update results UI logic: if total score < 50, display exactly \"Fail! Please review Day 1 stories again.\"; if total score >= 150, display exactly \"Success! Day 2 is now unlocked.\"; otherwise show an English-only neutral message indicating the user did not unlock the next day yet. Remove emoji and perfect-score-only logic, and ensure the submitted score sent via useSubmitTestScore() is the computed 0–200 total."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update Button 4 UI copy to reflect new passing criteria (150/200) and updated feedback behavior.",
      "acceptanceCriteria": [
        "Home page Button 4 description and the Day 1 test page header/description no longer claim 200/200 is required, and instead reflect 150/200 passing rules.",
        "The results screen no longer shows \"Perfect Score!\" / \"Test Failed\" logic tied to 200/200; it reflects pass/fail based on >=150, <50 messaging, and an appropriate non-pass/non-<50 state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the Button 4 (\"The 200-Mark Gate\") description copy to reflect the new passing criteria: score 150/200 (not 200/200) to unlock the next day. Ensure English-only wording and no emoji."
        },
        {
          "path": "frontend/src/pages/Day1TestPage.tsx",
          "operation": "modify",
          "description": "Update the Day 1 test header/description and results headings so they no longer imply a perfect-score requirement. Ensure displayed guidance reflects pass >= 150/200, the <50 fail instruction message rule, and English-only user-facing text."
        }
      ]
    }
  ]
}