{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "News app that fetches and displays regional headlines from the GNews API, with independent region loading and per-region error handling.",
  "architectural_notes": [
    "Load each region's feed independently (no cross-region blocking).",
    "Isolate failures per region; render empty-state per region without impacting others."
  ],
  "known_issues": [
    "News app stuck due to region loading dependency (Israel feed must load before other regions enable)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-remove-the-israel-first-gating-so-that-all-supported-regions-india-dubai-west-bengal-israel-can-load-news-independently-without-requiring-israel-news-to-load-successfully-first",
      "title": "Remove the Israel-first gating so that all supported regions (India, Dubai, West Bengal, Israel) can load news independently without requiring Israel news to load successfully first.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-set-india-as-the-primary-default-news-region-in-the-news-page-ui-by-ordering-india-first-among-regions-shown",
      "title": "Set India as the primary/default news region in the News page UI by ordering India first among regions shown.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-frontend-region-news-query-pipeline-so-that-when-not-in-demo-mode-region-sections-fetch-their-region-data-from-the-backend-parse-the-gnews-response-and-display-results-for-each-region-independently",
      "title": "Update the frontend region-news query pipeline so that, when not in demo mode, region sections fetch their region data from the backend, parse the GNews response, and display results for each region independently.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-adjust-per-region-failure-behavior-so-that-if-one-region-fails-to-load-network-error-backend-error-parse-error-or-empty-response-that-region-shows-an-empty-state-while-other-regions-continue-to-load-and-render-successfully",
      "title": "Adjust per-region failure behavior so that if one region fails to load (network error, backend error, parse error, or empty response), that region shows an empty state while other regions continue to load and render successfully.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Connect GNews top-headlines API to a News list view showing title, description, and image; open article url in a new browser tab on click",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Remove gating dependency so regions (India, Dubai, West Bengal, Israel) load independently (do not require Israel to load first)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Set India as the default/primary news region and use GNews top-headlines endpoint with country=in for the main screen",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Implement per-region error handling: if one region fails or returns no news, show an empty state only for that region while others still load",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Implement backend support to fetch and cache India top headlines using the exact GNews endpoint provided by the user, and expose it via a region-specific backend method that the frontend can call without embedding the API key in the client.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Pass English Speaking",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}